IDEA StatiCa Open Model
RebarSegment3DBase.EndPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the endpoint of the segment.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarPoint3D EndPoint { get; set; }
Public Property EndPoint As RebarPoint3D
	Get
	Set
public:
property RebarPoint3D^ EndPoint {
	RebarPoint3D^ get ();
	void set (RebarPoint3D^ value);
}
Property Value
Type: RebarPoint3D
See Also
Reference
RebarSegment3DBase Class
IdeaRS.OpenModel.Model Namespace